
items = [ // [row_number, description, quantity, unitPrice, amount]
[1,"茶裏王台灣綠茶",2,20,40],[2,"茶裏王英式紅茶",20,20,400]
];
items2 = [
[1,"茶裏王台灣綠茶",2,20,40],[2,"茶裏王英式紅茶",20,20,400],[3,"茶裏王烏龍綠茶",1,20,20],[4,"茶裏王青心烏龍",35,20,700]
];
items3 = [
[1,"A4影印",23,2,46],[2,"麥香紅茶",1,10,10],[3,"麥香奶茶",12,10,120]
];
invocie = [
["20150204","AV1234567890",100,items],
["20150205","AV1234567891",1000,items2],
["20150206","AV1234567892",2100,items3]
];
test_data = [
[121.522932,25.041973,"男四","台北市中正區紹興南街6號",233,invocie,1],
[121.521613,25.040995,"男二","台北市中正區徐州路2-3號",131,invocie,1],
[121.518941,25.040797,"臺大醫院","台北市中正區中山南路7號",34,invocie,1],
[121.523083,25.041254,"公衛學院","台北市中正區徐州路3號",33,invocie,1],
[121.525110,25.040836,"舊社科院","台北市中正區徐州路21號",72,invocie,1],
[121.541536,25.019615,"德田館","台北市大安區羅斯福路四段1號",108,invocie,2],
[121.544079,25.017771,"明達館","台北市大安區羅斯福路四段1號",21,invocie,2],
[121.540925,25.017421,"總圖","台北市大安區羅斯福路四段1號",56,invocie,2],
[121.543522,25.026107,"捷運科技大樓站","台北市大安區復興南路二段235號",1,invocie,3],
[121.543599,25.024967,"勝立百貨","台北市大安區復興南路二段291號",2,invocie,3]
];